# Patika Veri Analizi - 2.Hafta Görevi

Titanic veri seti altında aşağıdaki soruları, notebook açarak çözebilirsiniz. Her sorunun markdown olarak yazılması ve altına da kodunun yazılması daha okunaklı kılar kodlarınızı.

1.	Kazada ölenlerin yaş ortalamasını bulunuz

2.	Kazada ölenlerin bilet fiyatlarının ortalamasını ve medyanını bulunuz

3.	Kazada ölen erkeklerin yaş ortalamasını bulunuz

4.	Kazada ölen Kadınların yaş ortalamasını bulunuz

5.	Kazadan kurtulanların yaş ortalamasını bulunuz

6.	Kazadan kurtulanların bilet fiyatlarının ortalamasını bulunuz

7.	Kazadan kurtulan toplam kişi sayısını bulunuz… 

(tüyo: len(df_titanic[(df_titanic.Survived==1)]   kodu ile de bu sayıya ulaşabilirsiniz.)

8.	10 yaşından küçüklerin bilet fiyatlarının medyan değerini bulunuz

9.	1.sınıf, 2.sınıf ve 3.sınıf bilet fiyatlarının ortalama ve medyanlarını karşılaştırınız. (Pclass değişkeni sınıfları barındırmaktadır.)

10.	Kazada ölen kadınların oranı ile erkeklerin oranını karşılaştırınız. (Örnek: erkekler için; ölen erkeklerin, erkek sayısına bölümü bu oranı vermektedir.

In [69]:
import pandas as pd
import numpy as np

In [70]:
df = pd.read_csv("Titanic_dataset.csv")

In [71]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

### Değişken Bilgileri
- PassengerId = Yolcuların ID'leri
- Survived =  0: No, 1: Yes
- Pclass = Yolcu sınıfları ( 1 = 1.Sınıf, 2 = 2.Sınıf, 3 = 3.Sınıf )
- Name = Yolcuların isimleri
- Sex = Yolcuların cinsiyeti ( male = erkek, female = kadın )
- Age = Yolcuların yaşları
- SibSp = Titanic'teki kardeş/ eş sayısı
- Parch = Titanic'teki ebeveyn/ çocuk sayısı
- Ticket = Bilet numarası
- Fare = Bilet ücreti
- Cabin = Kabin numarası
- Embarked = Gemiye binilen liman ( C = Cherbourg, S = Southampthon, Q = Queenstown )

In [72]:
# 1. Kazada ölenlerin yaş ortalamasını bulunuz

df[df["Survived"] == 0]["Age"].mean()

30.62617924528302

In [73]:
# 2. Kazada ölenlerin bilet fiyatlarının ortalamasını ve medyanını bulunuz

df[df["Survived"] == 0]["Fare"].agg(["mean", "median"])

mean      22.117887
median    10.500000
Name: Fare, dtype: float64

In [74]:
# 3. Kazada ölen erkeklerin yaş ortalamasını bulunuz


df[(df["Survived"] == 0) & (df["Sex"] == "male")]["Age"].mean()

31.618055555555557

In [75]:
# 4. Kazada ölen Kadınların yaş ortalamasını bulunuz

df[(df["Survived"] == 0) & (df["Sex"] == "female")]["Age"].mean()

25.046875

In [76]:
# 5. Kazadan kurtulanların yaş ortalamasını bulunuz

df[df["Survived"] == 1]["Age"].mean()

28.343689655172415

In [77]:
# 6. Kazadan kurtulanların bilet fiyatlarının ortalamasını bulunuz

df[df["Survived"] == 1]["Fare"].mean()

48.39540760233918

In [78]:
# 7.  Kazadan kurtulan toplam kişi sayısını bulunuz…

len(df[df["Survived"] == 1])

342

In [79]:
# 8. 10 yaşından küçüklerin bilet fiyatlarının medyan değerini bulunuz

df[df["Age"] < 10]["Fare"].median()

27.0

In [80]:
# 9. 1.sınıf, 2.sınıf ve 3.sınıf bilet fiyatlarının ortalama ve medyanlarını karşılaştırınız. (Pclass değişkeni sınıfları barındırmaktadır.)

df.groupby("Pclass")["Fare"].agg(["mean", "median"])

             mean   median
Pclass
1       84.154687  60.2875
2       20.662183  14.2500
3       13.675550   8.0500

In [81]:
# 10. Kazada ölen kadınların oranı ile erkeklerin oranını karşılaştırınız. (Örnek: erkekler için; ölen erkeklerin, erkek sayısına bölümü bu oranı vermektedir.


oranlar = df.groupby("Sex").agg(toplam=("Sex", "count"), olen=("Survived", lambda x: (x == 0).sum()))
oranlar["olen_orani"] = oranlar["olen"] / oranlar["toplam"] * 100

print(oranlar)

        toplam  olen  olen_orani
Sex
female     314    81   25.796178
male       577   468   81.109185